paulgreg/ESP32_VS1053_Stream_raw/src/ESP32_VS1053_Stream_raw.cpp
    if (stream && stream->available() && _metaDataStart && _musicDataPosition == _metaDataStart && _bytesLeftInChunk)
    {
        const auto DATA_NEEDED = stream->peek() * 16 + 20; /* plus 20 because there could be a end-of-chunk in the data */
        if (stream->available() < DATA_NEEDED)
            return;

        const auto METALENGTH = stream->read() * 16;
        _bytesLeftInChunk--;
        if (METALENGTH)
        {
            char data[METALENGTH];
            auto cnt = 0;
            while (cnt < METALENGTH)
            {
                if (!_bytesLeftInChunk)
                {
                    if (!_checkSync(stream))
                    {
                        _remainingBytes = 0;
                        return;
                    }
                    else
                    {
                        _bytesLeftInChunk = _nextChunkSize(stream);
                        if (!_bytesLeftInChunk)
                        {
                            _remainingBytes = 0;
                            return;
                        }
                    }
                }
                data[cnt++] = stream->read();
                _bytesLeftInChunk--;
            }
            if (audio_showstreamtitle)
                _handleMetadata(data, METALENGTH);
        }
        _musicDataPosition = 0;
    }

    if (!stream)
        return;

    if (!_bytesLeftInChunk && stream->available() < 20) /* make sure we dont run out of data in the next test*/
        return;

    if (!_bytesLeftInChunk && !_checkSync(stream))
    {
        _remainingBytes = 0;
        return;
    }
}

void ESP32_VS1053_Stream_raw::loop()
{
    if (_playingFile && _file && _vs1053->data_request())
    {
        _handleLocalFile();
        return;
    }

    if (!_http)
        return;

    if (!_http->connected())
    {
        log_e("Stream disconnect");
        _eofStream();
        return;
    }

    WiFiClient *const stream = _http->getStreamPtr(); /* this WILL be a NULL ptr at the end of real files -in psram buffer mode- when al stream data is read but not yet in the decoder */
    if (!_ringbuffer_handle && !stream)
    {
        log_e("Stream connection lost");
        _eofStream();
        return;
    }

    if (!_ringbuffer_handle && !stream->available())
    {
        if (!_streamStalledTime)
        {
            _streamStalledTime = millis();
            _streamStalledTime += _streamStalledTime ? 0 : 1;
            return;
        }
        if (millis() - _streamStalledTime > VS1053_NOBUFFER_TIMEOUT_MS)
        {
            log_e("Stream timeout %lu ms", VS1053_NOBUFFER_TIMEOUT_MS);
            _eofStream();
            return;
        }
        return;
    }

    if (_ringbuffer_handle && stream && !stream->available() && !_streamStalledTime)
    {
        _streamStalledTime = millis();
        _streamStalledTime += _streamStalledTime ? 0 : 1;
    }

    if (stream && stream->available() && _streamStalledTime)
    {
        log_d("Stream stalled for %lu ms", millis() - _streamStalledTime);
        _streamStalledTime = 0;
    }

    if (_startMute)
    {
        const auto WAIT_TIME_MS = ((!bitrate() && _remainingBytes == -1) ||
                                   _currentCodec == AAC || _currentCodec == AACP || _currentCodec == OGG)
                                      ? 380
                                      : 80;
        if (millis() - _startMute > WAIT_TIME_MS)
        {
            _vs1053->setVolume(_volume);
            log_d("startmute is %lu milliseconds", WAIT_TIME_MS);
            _startMute = 0;
        }
    }

    if (_remainingBytes && _vs1053->data_request())
    {
        if (_chunkedResponse)
            _handleChunkedStream(stream);
        else
            _handleStream(stream);
    }

    if (!_remainingBytes)
        _eofStream();
}

bool ESP32_VS1053_Stream_raw::isRunning()
{
    return _http != nullptr || _playingFile;
}

void ESP32_VS1053_Stream_raw::stopSong()
{
    if (!_http && !_playingFile)
        return;

    _vs1053->setVolume(0);
    _currentCodec = STOPPED;

    if (_playingFile)
    {
        _file.close();
        _playingFile = false;
        return;
    }

    _http->end();
    delete _http;
    _http = nullptr;
    _deallocateRingbuffer();
    _ringbuffer_filled = false;
    _bytesLeftInChunk = 0;
    _dataSeen = false;
    _remainingBytes = 0;
    _offset = 0;
}

uint8_t ESP32_VS1053_Stream_raw::getVolume()
{
    return _volume;
}

void ESP32_VS1053_Stream_raw::setVolume(const uint8_t newVolume)
{
    _volume = min(VS1053_MAXVOLUME, newVolume);
    if (_vs1053 && !_startMute)
        _vs1053->setVolume(_volume);
}

void ESP32_VS1053_Stream_raw::setTone(uint8_t *rtone)
{
    if (_vs1053)
        _vs1053->setTone(rtone);
}

const char *ESP32_VS1053_Stream_raw::currentCodec()
{
    const char *name[] = {"STOPPED", "MP3", "OGG", "AAC", "AAC+"};
    return name[_currentCodec];
}

const char *ESP32_VS1053_Stream_raw::lastUrl()
{
    return (_http || _playingFile) ? _url : "";
}

size_t ESP32_VS1053_Stream_raw::size()
{
    if (_playingFile)
        return _file.size();
    return _offset + (_http ? _http->getSize() != -1 ? _http->getSize() : 0 : 0);
}

size_t ESP32_VS1053_Stream_raw::position()
{
    if (_playingFile)
        return _file.position();
    return size() ? (size() - _remainingBytes) : 0;
}

uint32_t ESP32_VS1053_Stream_raw::bitrate()
{
    if (_playingFile)
        return 0;
    return _http ? _http->header(BITRATE).toInt() : 0;
}

const char *ESP32_VS1053_Stream_raw::bufferStatus()
{
    if (!_ringbuffer_handle)
        return "0/0";
    static char ringbuffer_status[24];
    snprintf(ringbuffer_status, sizeof(ringbuffer_status), "%u/%u", VS1053_PSRAM_BUFFER_SIZE - xRingbufferGetCurFreeSize(_ringbuffer_handle), VS1053_PSRAM_BUFFER_SIZE);
    return ringbuffer_status;
}

void ESP32_VS1053_Stream_raw::bufferStatus(size_t &used, size_t &capacity)
{
    used = _ringbuffer_handle ? VS1053_PSRAM_BUFFER_SIZE - xRingbufferGetCurFreeSize(_ringbuffer_handle) : 0;
    capacity = _ringbuffer_handle ? VS1053_PSRAM_BUFFER_SIZE : 0;
}

bool ESP32_VS1053_Stream_raw::connecttofile(fs::FS &fs, const char *filename)
{
    return connecttofile(fs, filename, 0);
}

