paulgreg/ESP32_VS1053_Stream_raw/src/ESP32_VS1053_Stream_raw.cpp
bool ESP32_VS1053_Stream_raw::connecttofile(fs::FS &fs, const char *filename, const size_t offset)
{
    if (!_vs1053 || _playingFile || _http)
        return false;

    _file = fs.open(filename, FILE_READ, false);
    if (!_file)
    {
        log_e("could not open file");
        return false;
    }

    if (offset >= _file.size())
    {
        _file.close();
        return false;
    }

    _currentCodec = (_file.read() == 0xFF && _file.read() == 0xFB) ? MP3 : _currentCodec;
    _file.seek(0);
    _currentCodec = (_file.read() == 0x49 && _file.read() == 0x44 && _file.read() == 0x33) ? MP3 : _currentCodec;

    _file.seek(0);
    _currentCodec = (_file.read() == 0x4F && _file.read() == 0x67 && _file.read() == 0x67) ? OGG : _currentCodec;

    if (_currentCodec == STOPPED)
    {
        log_w("unsupported file");
        _file.close();
        return false;
    }

    _file.seek(offset);
    if (strcmp(filename, _url))
    {
        _vs1053->stopSong();
        snprintf(_url, VS1053_MAX_URL_LENGTH, "%s", filename);
        _vs1053->startSong();
    }
    _filesystem = &fs;
    _playingFile = true;
    _vs1053->setVolume(_volume);
    return true;
}

void ESP32_VS1053_Stream_raw::_handleLocalFile()
{
    if (!_filesystem->exists(_url))
    {
        log_e("fs error - bailing out");
        _eofStream();
        return;
    }

    /* this loop is IO driven where -some- transactions take a serious amount of time */
    /* and because of that -sometimes- it takes much longer to finish a loop than MAX_MS suggests */
    /* sometimes up to 13-15 ms */
    const auto START_MS = millis();
    const auto MAX_MS = 5;

    while (millis() - START_MS < MAX_MS && _file.available() && _vs1053->data_request())
    {
        const size_t BYTES_IN_BUFFER =
            _file.readBytes((char *)_vs1053Buffer, min((size_t)_file.available(), VS1053_PLAYBUFFER_SIZE));
        _vs1053->playChunk(_vs1053Buffer, BYTES_IN_BUFFER);
    }

    if (!_file.available() && _file.position() == _file.size())
        _eofStream();
}
